tutorials/modules/multiphaseEuler/wallBoilingIATE/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    thermalPhaseChangeMultiphaseSystem;

phases (gas liquid);

gas
{
    type            purePhaseModel;
    diameterModel   IATE;

    IATECoeffs
    {
        dMax 1e-2;
        dMin 1e-4;
        residualAlpha 1e-4;

        sources
        (
            wakeEntrainmentCoalescence
            {
                Cwe         0.002;
            }

            randomCoalescence
            {
                Crc         0.04;
                C           3;
                alphaMax    0.75;
            }

            turbulentBreakUp
            {
                Cti         0.085;
                WeCr        6;
            }

            phaseChange
            {
                otherPhase  liquid;
                dmdtf       thermalPhaseChange:dmdtf;
            }

            wallBoiling
            {}
        );
    }

    constantCoeffs
    {
        d               0.00045;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;
    diameterModel   none;
    Sc              0.7;

    residualAlpha   1e-6;
}

drag
{
    gas_dispersedIn_liquid
    {
        type            IshiiZuber;
    }
}

virtualMass
{
    gas_dispersedIn_liquid
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    gas_dispersedIn_liquid_inThe_gas
    {
        type constantNu;
        Nu  1e1;
        residualAlpha 1e-4;
    }

    gas_dispersedIn_liquid_inThe_liquid
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }
}

lift
{
    gas_dispersedIn_liquid
    {
        type wallDamped;

        lift
        {
            type Tomiyama;
            Cl 0.288;

            aspectRatio
            {
                type constant;
                E0 1;
            }
        }

        wallDamping
        {
            type    cosine;
            Cd      1.0;
            zeroWallDist 0.0002;
        }
    }
}

wallLubrication
{
   gas_dispersedIn_liquid
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
}

turbulentDispersion
{
    gas_dispersedIn_liquid
    {
        type                LopezDeBertodano;
        Ctd                 1.0;
        residualAlpha       1e-3;
    }
}

blending
{
    default
    {
        type            continuous;
        phase           liquid;
    }
}

saturation
{
    gas_liquid
    {
        type function1;

        function scale;

        xScale 1e-6;
        scale   1;
        value
        {
            type                tableFile;
            format              csv;
            nHeaderLine         1;
            refColumn           1;
            componentColumns    (0);
            mergeSeparators     no;
            file "$FOAM_TUTORIALS/resources/thermoData/wallBoiling-saturation.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.00176574;
    }
}

phaseTransfer
{}

interfaceCompression
{}

// ************************************************************************* //
